# -*- coding: utf-8 -*-
初始单元格状态 = [[0, 0, 0, 0, 0, 0, 0, 1, 1],
                  [1, 1, 0, 0, 0, 0, 1, 1, 1],
                  [1, 1, 1, 0, 0, 1, 1, 1, 0],
                  [0, 1, 1, 1, 1, 1, 1, 0, 0],
                  [0, 0, 1, 1, 1, 1, 0, 0, 0]]

# 默认为普通难度

# 简单难度刷怪表: 1:0.5:0.1
刷怪表2 = [
    [0, 0, "普通僵尸", 0, 0, "普通僵尸", 0, 0, "普通僵尸", 0],
    ["普通僵尸", 0, 0, "路障僵尸", 0, 0, "普通僵尸", 0, 0, 0],
    [0, "普通僵尸", 0, 0, "路障僵尸", 0, 0, 0, 0, "自爆僵尸"],
    [0, 0, "普通僵尸", 0, 0, "路障僵尸", 0, "自爆僵尸", 0, "路障僵尸"],
    ["普通僵尸", 0, "路障僵尸", "普通僵尸", 0, 0, "路障僵尸", 0, 0,"自爆僵尸"],
    ["普通僵尸", 0, "路障僵尸", "普通僵尸", 0, "路障僵尸", "普通僵尸", 0, 0, "路障僵尸"],
    ["普通僵尸", 0, "路障僵尸", "普通僵尸", 0, "路障僵尸", 0, 0, 0, "自爆僵尸"],
    ["普通僵尸", 0, "路障僵尸", 0, "自爆僵尸", 0, 0, "路障僵尸", "普通僵尸", 'EG']]

# 普通难度刷怪表: 1:0.75:0.5

刷怪表3 = [
    ["普通僵尸", "路障僵尸", 0, 0, 0, "普通僵尸", 0, 0, "普通僵尸", 0],
    ["普通僵尸", "路障僵尸", 0, 0, 0, 0, "普通僵尸", "路障僵尸", 0, 0],
    [0, "普通僵尸", 0, "路障僵尸", 0, "路障僵尸", 0, 0, 0, 0],
    ["自爆僵尸", 0, "普通僵尸", 0, "路障僵尸", 0, "路障僵尸", 0, 0, "路障僵尸"],
    ["普通僵尸", "路障僵尸", "自爆僵尸", "普通僵尸", "路障僵尸", 0, 0, 0, "自爆僵尸", "自爆僵尸"],
    ["普通僵尸", "路障僵尸", "自爆僵尸", "普通僵尸", "路障僵尸", 0, "普通僵尸", 0, 0, "自爆僵尸"],
    ["普通僵尸", "路障僵尸", "自爆僵尸", "普通僵尸", "路障僵尸", 0, 0, 0, 0, "自爆僵尸"],
    ["普通僵尸", "路障僵尸", "自爆僵尸", 0, 0, 0, "自爆僵尸", "路障僵尸", "普通僵尸", 'EG']]

# 变态难度刷怪表: 0.5:0.5:0.5

刷怪表 = [
    ["路障僵尸", "自爆僵尸", 0, "路障僵尸", 0, "普通僵尸", "路障僵尸", 0, "普通僵尸", "路障僵尸"],
    ["普通僵尸", "自爆僵尸", 0, "路障僵尸", 0, "路障僵尸", "普通僵尸", "自爆僵尸", "路障僵尸", 0],
    ["路障僵尸", "普通僵尸", "自爆僵尸", 0, 0, "自爆僵尸", 0, 0, "路障僵尸", 0],
    ["路障僵尸", "路障僵尸", "普通僵尸", "自爆僵尸", 0, "自爆僵尸", 0, 0, "路障僵尸", 0],
    ["普通僵尸", "自爆僵尸", 0, "普通僵尸", "自爆僵尸", 0, "路障僵尸", 0, "路障僵尸", 0],
    ["普通僵尸", "自爆僵尸", 0, "普通僵尸", "自爆僵尸", 0, "普通僵尸", "自爆僵尸", 0, "路障僵尸"],
    ["普通僵尸", "自爆僵尸", 0, "普通僵尸", "自爆僵尸", 0, "路障僵尸", 0, "路障僵尸", 0],
    ["普通僵尸", "自爆僵尸", "自爆僵尸", "自爆僵尸", "自爆僵尸", "自爆僵尸", "自爆僵尸", "自爆僵尸", "普通僵尸", 'EG']]
